package org.example;



public class YandexTest {
    /**
     * 1) Нашел отличный пример с проектом.
     * Нужно взять статью и как написано в статье собрать проект и написать автотест,
     * который разобран в примере.  https://habr.com/ru/post/502292/
     * 2) Теперь закрепим что узнали. На основе проекта в п1 разработаем собсвенный автотест.
     * Сценарий такой:
     * Открыть главную страницу https://tramontana.ru/
     * Перейти в раздел «Альпинизм»
     * Перейти в раздел «Оттяжки»
     * У товарной карточки «УДОЧКА ДЛЯ ВСТЕГИВАНИЯ ОТТЯЖЕК KAILAS CLIP UP III» - проверить прайс.
     */





}
